### Pandas

DataFrames and series

In [1]:
import pandas as pd

In [2]:
##Series
#A onadaseries is a  one dimensional  array like object that can hold any data types .it is similar to a column in a table


data=[1,2,3,4]
series=pd.Series(data)
print("series\n",series)
print(type(series))

series
 0    1
1    2
2    3
3    4
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
#create a series from dictionary 
data={'a':1,'b':2,'c':3}
series_data=pd.Series(data)
print(series_data)

a    1
b    2
c    3
dtype: int64

In [4]:
data=[10,20,30,40,50]
index=['a','b','c','d','e']
pd.Series(data,index)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [5]:
#Dataframe 

#create a datframe from a dictionary of list
data={'Name':['ram','john','jack'],
      'age':[25,30,45],
      'city':['banagalore','New york','florida']
      }
df=pd.DataFrame(data)
print(df)
print(type(df))

   Name  age        city
0   ram   25  banagalore
1  john   30    New york
2  jack   45     florida
<class 'pandas.core.frame.DataFrame'>

In [6]:
import numpy as np
np.array(df)

array([['ram', 25, 'banagalore'],
       ['john', 30, 'New york'],
       ['jack', 45, 'florida']], dtype=object)

In [7]:
#create a datframe from list of dictionary


data=[{'name':'ram','age':30,'city':'patna'},
      {'name':'john','age':56,'city':'jaipur'},
      {'name':'jack','age':95,'city':'delhi'}]
df=pd.DataFrame(data)
print(df)

   name  age    city
0   ram   30   patna
1  john   56  jaipur
2  jack   95   delhi

In [8]:
df1=pd.read_csv('sales1_data.csv')
print(df1.head())
print()
print()
print()
print(df1.tail())

         Date   Product  Sales Region
0  2023-01-01  Product3  738.0   West
1  2023-01-02  Product2  868.0  North
2  2023-01-03  Product2  554.0   West
3  2023-01-04  Product1  618.0  South
4  2023-01-05  Product3  501.0   East



          Date   Product  Sales Region
20  2023-01-21  Product2    NaN   West
21  2023-01-22  Product3  296.0   West
22  2023-01-23  Product2  737.0   West
23  2023-01-24  Product3  531.0   East
24  2023-01-25  Product2  834.0  North

In [9]:
#Accessing data from dataframe
df

   name  age    city
0   ram   30   patna
1  john   56  jaipur
2  jack   95   delhi

In [10]:
print(df['name'])
print(type(df['name']))

0     ram
1    john
2    jack
Name: name, dtype: object
<class 'pandas.core.series.Series'>

In [11]:
#another way
df.loc[0]

name      ram
age        30
city    patna
Name: 0, dtype: object

In [12]:
#another way
df.loc[1][0]

C:\Users\HP\AppData\Local\Temp\ipykernel_9784\2655643465.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[1][0]

'john'

In [13]:
#Accessing Specific element
df.at[2,'name']

'jack'

In [14]:
#Accessing Specific element
print(df.at[1,'age'])

56

In [15]:
#Accesssing specified element using iat
df.iat[2,2]

'delhi'

In [16]:
#Data Manipulatoin with dataframe
df

   name  age    city
0   ram   30   patna
1  john   56  jaipur
2  jack   95   delhi

In [17]:
df['salary']=[50000,60000,70000]
df

   name  age    city  salary
0   ram   30   patna   50000
1  john   56  jaipur   60000
2  jack   95   delhi   70000

In [18]:
#Removing an column
df.drop('salary')#we have to apecify axis by default axis=0 that means row

KeyError: "['salary'] not found in axis"

In [19]:
#Removing an column
df.drop('salary',axis=1,inplace=True)

In [20]:
df

   name  age    city
0   ram   30   patna
1  john   56  jaipur
2  jack   95   delhi

In [25]:
#Note:since we hav deleted coumn salary but still 
# presenet to make it permanent chaneg use attribute
#  inplace=TRUE
#Removing an column
df.drop('salary',axis=1,inplace=True)
df

KeyError: "['salary'] not found in axis"

In [22]:
#Add age to the column
df['age']=df['age']+1
df

   name  age    city
0   ram   31   patna
1  john   57  jaipur
2  jack   96   delhi

In [23]:
#droping row
df.drop(0,inplace=True)
print(df)

   name  age    city
1  john   57  jaipur
2  jack   96   delhi

In [26]:
df1.head()

         Date   Product  Sales Region
0  2023-01-01  Product3  738.0   West
1  2023-01-02  Product2  868.0  North
2  2023-01-03  Product2  554.0   West
3  2023-01-04  Product1  618.0  South
4  2023-01-05  Product3  501.0   East

In [28]:
#display the data types of each column
print("Data types :\n ",df1.dtypes)

Data types :
  Date        object
Product     object
Sales      float64
Region      object
dtype: object

In [30]:
#describe the data frame
df1.describe()

            Sales
count   19.000000
mean   554.000000
std    231.543372
min    124.000000
25%    381.500000
50%    554.000000
75%    737.500000
max    868.000000